<?php
    // 상수 : 주어진 값을 일정하게 가진 것으로 문자열, 정수, 실수 등이 있다.
    // 문자열 : 큰따옴표로 감싼 하나 또는 여러 개의 문자

    // 변수 : 입력하는 값에 따라 내용이 변하는 것으로 상수와 반대되는 개념
    // PHP에서 변수는 $로 시작하고, 변수명은 일반적으로 영문 소문자와 숫자, 밑줄(_)을 조합해서 만든다.
    // $a, $b, $x, $var, $age, $month, $fee, $bus1, $taxi3 등은 모두 올바른 변수명이다.


    $a = 10;
    $b = 20;
    $c = $a + $b;
    echo "$c <br>";

    $a = 18.5;
    $b = 37.3;
    $c = $a + $b;
    echo "$c <br>";
    
    $fruit = "사과";
    echo "$fruit <br>";

    $fruit = "오렌지";
    echo "$fruit <br>";

?>